[
    {
        "title": "Iot-Based DC Motor Speed Control Learning Module with PID",
        "year": "2025",
        "description": "- Developed the hardware programming for ESP32 to control DC motor speed using PID algorithms.\n- Implemented MQTT for seamless data transmission between the ESP32 and the cloud platform.\n- Managed database integration for storing and retrieving motor performance data and control parameters.\n- Contributed to web programming to create a user interface for real-time monitoring and control of the DC motor module.",
        "image": "images/project1.png",
        "link": "https://example.com/solar-water"
    },
    {
        "title": "IoT-Based Water Pipe Leak Detection Device",
        "year": "2024",
        "description": "-Designed an IoT solution for water pipe leak detection with real-time flow sensor integration.\n- Managed PCB design, assembly, soldering, and troubleshooting until the prototype was functional.\n- Developed C software for data acquisition, analysis, and cloud transmission.",
        "image": "images/project2.png",
        "link": "https://example.com/assembly-optimization"
    },
	{
        "title": "Greenhouse Monitoring System Using ESP32",
        "year": "2023",
        "description": "- Developed an ESP32-based greenhouse monitoring system that provides environmental data analysis and growth optimization recommendations.\n- Successfully integrated ESP32, temperature & humidity sensors, and Arduino IDE code for data collection.\n- Collaborated in a team to ensure effective hardware and software integration and optimal system performance.",
        "image": "images/project3.png",
        "link": "https://example.com/assembly-optimization"
    },
    {
        "title": "Analog Mini Audio Amplifier",
        "year": "2023",
        "description": "- Designed and optimized analog mini amplifier schematics, improving efficiency and sound quality through circuit analysis.\n- Successfully managed assembly, component selection, functionality testing, output adjustment, and troubleshooting to produce a working amplifier.\n- Collaborated effectively in a team to achieve project targets by applying problem-solving skills.",
        "image": "images/project4.png",
        "link": "https://example.com/solar-water"
    },
	{
        "title": "Electronic Diagnostic Test Pen",
        "year": "2022",
        "description": "- Developed an electronic test pen, including PCB design, component assembly, soldering, and troubleshooting.\n- Managed the entire project, from concept to final implementation, ensuring circuit performance met standards.",
        "image": "images/project5.png",
        "link": "https://example.com/solar-water"
    },
]
